** DONE verilog simulation and synthesis on MacOS
   CLOSED: [2020-07-02 Thu 17:01]
   :PROPERTIES:
   :ID:       D9C15D64-25C0-4776-9D50-E8B24117506F
   :END:
   :LOGBOOK:
   CLOCK: [2020-07-01 Wed 11:14]--[2020-07-01 Wed 11:26] =>  0:12
   :END:
 [2020-07-01 Wed 11:14]

** DONE FPGA hardware
   CLOSED: [2020-07-30 周四 16:50] SCHEDULED: <2020-07-20 Mon 14:30>
   :LOGBOOK:
   CLOCK: [2020-07-15 周三 19:37]--[2020-07-15 周三 19:38] =>  0:01
   :END:
   时间点安排在：把 ‘FPGA原理与结构’ 读完一遍之后，参考了 ‘FPGA芯片架构设计与实现’ 之后
 需要参考 FPGA原理与结构 的第三章，再修改以下内容：

*** DONE book: FPGA设计与实现
    DEADLINE: <2020-07-17 Fri 21:00>
    :LOGBOOK:
    CLOCK: [2020-07-15 周三 19:01]--[2020-07-15 周三 19:37] =>  0:36
    CLOCK: [2020-07-15 周三 16:58]--[2020-07-15 周三 17:03] =>  0:05
    :END:

*** DONE Book: FPGA芯片结构与设计实现
    CLOSED: [2020-07-15 Wed 09:18]

    未读完，选择性参阅。
    :LOGBOOK:
    CLOCK: [2020-07-06 Mon 10:34]--[2020-07-06 Mon 10:35] =>  0:01
    CLOCK: [2020-07-05 Sun 21:49]--[2020-07-05 Sun 21:51] =>  0:02
    :END:
  [2020-07-05 Sun 21:49]

***** 逻辑单元
      :LOGBOOK:
      CLOCK: [2020-07-06 Mon 09:26]--[2020-07-06 Mon 10:34] =>  1:08
      :END:
  基于查找表(Look Up Table, LUT)的可编程逻辑单元主要由以下几部分组成:
  两个四输入的LUT，两个进位逻辑，两个可编程触发器DFF，还包含64个配置用的SRAM、信号产生模块以及控制逻辑等。每个可编程逻辑单元中还包含一个与门资源，用来实现有效的乘法运算。可实现组合逻辑电路和时序逻辑电路。

**** 时钟
     :LOGBOOK:
     CLOCK: [2020-07-05 Sun 21:51]--[2020-07-05 Sun 22:04] =>  0:13
     :END:
     门控时钟通过不使用的时候断开CLK，可以降低功率

     时钟网络是时钟源和寄存器时钟端之间的一系列组合逻辑和金属连线组成的网格结构，设计优劣在一定程度上决定这FPGA系统整体的速度、功耗和面积。

     - 树形时钟网络：输出端都是独立分支
     - 网格时钟网络：输出端通过纵横金属网格连接起来

**** 电源
     :LOGBOOK:
     CLOCK: [2020-07-05 Sun 22:04]--[2020-07-05 Sun 22:15] =>  0:11
     :END:
     电源/地线网络分析和漏电优化技术（电源完整性）

** FPGA资源利用
     :LOGBOOK:
     CLOCK: [2020-07-17 周五 10:53]--[2020-07-17 周五 11:27] =>  0:34
     CLOCK: [2020-07-17 周五 09:32]--[2020-07-17 周五 10:33] =>  1:01
     :END:
把逻辑功能定位到专用硬件资源，参考[[*FPGA hardware][FPGA Hardware]]

*** DONE Book:Recommended HDL coding style
    CLOSED: [2020-08-29 Sat 09:35]
    :LOGBOOK:
    CLOCK: [2020-08-28 Fri 09:42]--[2020-08-28 Fri 09:54] =>  0:12
    :END:
  [2020-08-28 Fri 09:42]
  synthesis tools detect sets of operators that can be replaced with the megafunctions for device families that have dedicated RAM blocks, or may map them directly to device memory atoms.
**** DONE 乘法器和DSP
     CLOSED: [2020-08-29 Sat 09:39]
     :LOGBOOK:
     CLOCK: [2020-08-28 Fri 09:57]--[2020-08-28 Fri 10:16] =>  0:19
     :END:
  register packing: 把输入输出寄存器打包放进DSP中

  在DSP中添加寄存器，可以加快时钟工作频率，但会引入3个时钟延时。
**** DONE memory: ROM and RAM
     CLOSED: [2020-08-29 Sat 09:40]
     :LOGBOOK:
     CLOCK: [2020-08-28 Fri 10:26]--[2020-08-28 Fri 11:32] =>  1:06
     :END:
  memory blocks in the newest devices from Altera are synchronous, RAM designs that are targeted towards architectures that contain these dedicated memory blocks must be synchronous to be mapped directly

  ROMs are inferred when a CASE statement exists in which a value is set to a constant for every choice in the case statement

  想要初始化，使用 initial 块，这是可综合的，在initial块内，也可以使用$readmemh()

** DONE book: 高性能FPGA系统--时序设计与分析
   CLOSED: [2020-07-18 周六 12:03] DEADLINE: <2020-07-22 周三 11:00>
   :LOGBOOK:
   CLOCK: [2020-07-16 周四 09:35]--[2020-07-16 周四 09:38] =>  0:03
   CLOCK: [2020-07-16 周四 09:20]--[2020-07-16 周四 09:33] =>  0:13
   CLOCK: [2020-07-16 周四 08:36]--[2020-07-16 周四 08:44] =>  0:08
   :END:

*** DONE FPGA设计流程
    CLOSED: [2020-07-16 周四 21:02]
     :LOGBOOK:
     CLOCK: [2020-07-16 周四 08:44]--[2020-07-16 周四 09:20] =>  0:36
     :END:
 该部分内容可以帮助分析AIPre项目的架构，查漏补缺，方便在面试时进行交流。

 - 需求定义阶段
   定义并完善高层次工程师项目的详细功能和性能需求，完成系统的功能说明
 - 系统设计阶段
   选择功能实现技术；
   选择期间厂商、型号和开发工具；
   定义系统架构，考虑设计实现的可升级性；
   分割固有功能模块与可编程模块；
   定义设计模块功能和接口
 - 实现阶段
   实现整个设计，设计输入、复查、约束、整合；
   初始设计仿真、时序验证、报告分析；
 - 验证阶段
   设计测试、时序验证、设计重构；
   产生下载到目标板的配置文件；
   在目标板上调试和验证功能；
   使用基于FPGA的嵌入式逻辑分析仪测试功能

*** DONE 时序参数和时序路径
    CLOSED: [2020-07-30 周四 16:48] DEADLINE: <2020-07-21 周二 21:00>
     :LOGBOOK:
     CLOCK: [2020-07-16 周四 10:48]--[2020-07-16 周四 10:49] =>  0:01
     CLOCK: [2020-07-16 周四 09:38]--[2020-07-16 周四 10:40] =>  1:02
     :END:
 这一部分属于概念解释，在后面遇到时进行补充

*** DONE 时序分析
    CLOSED: [2020-08-29 Sat 09:35] SCHEDULED: <2020-08-27 Thu 19:30>
     :LOGBOOK:
     CLOCK: [2020-07-17 周五 09:27]--[2020-07-17 周五 09:32] =>  0:05
     :END:
 综合工具根据代码风格决定如何优化硬件架构

** DONE SOPC, 动态重构， 虚拟化
   CLOSED: [2020-08-26 Wed 21:32]
   :LOGBOOK:
   CLOCK: [2020-07-16 周四 09:33]--[2020-07-16 周四 09:35] =>  0:02
   :END:
 [2020-07-16 周四 09:33]
 [[file:g:/CHxin/NutCloud/orgible/inbox.org::*book: 高性能FPGA系统--时序设计与分析][book: 高性能FPGA系统--时序设计与分析]] 第一章第二节
 动态重构技术可以参考 ‘book：可重构计算’ 第五章

 静态重构：在计算之前对数据通路进行功能重构。时间代价大。典型的处理器是细粒度的FPGA
 静态重构的时间：Stratix 5型号为GXA3，配置文件大小为214M，采用串行低配置带宽和并行高配置带宽，对FPGA进行重构的时间分别为0.534s和0.067s。

 动态重构：在计算过程中对数据通路进行功能重构。典型的处理器是粗粒度的CGRA（可重构阵列），配置信息量小。

 静态和动态重构的主要区别：配置进行时非配置区域的工作状态，需要停下来等待，则认为是静态，如果其他区域不被打断，则具备动态。

 部分重构：数据通路在空间上被划分为多个区域，每个区域可以被重构为不同的功能，而不会影响到其他区域的当前状态。
** DONE PCIe and NVMe
   CLOSED: [2020-07-19 周日 21:39] SCHEDULED: <2020-07-18 Sat 9:00>
   :LOGBOOK:
   CLOCK: [2020-07-02 Thu 21:43]--[2020-07-02 Thu 22:17] =>  0:34
   :END:
 [2020-07-02 Thu 21:43]

 可以参考book: altera IP核关于PCIe的部分

** DONE 老石谈芯
   CLOSED: [2020-09-09 Wed 16:53]
   :LOGBOOK:
   CLOCK: [2020-09-08 Tue 18:23]--[2020-09-08 Tue 18:40] =>  0:17
   CLOCK: [2020-09-07 Mon 14:32]--[2020-09-07 Mon 14:39] =>  0:07
   CLOCK: [2020-09-07 Mon 10:12]--[2020-09-07 Mon 11:24] =>  1:12
   CLOCK: [2020-09-07 Mon 09:20]--[2020-09-07 Mon 10:08] =>  0:48
   :END:
 https://zhuanlan.zhihu.com/c_1071374786155958272
